In [1]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('/home/skanrns97/dataset/P210201.csv')

In [16]:
df.head(5)

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [19]:
df = df.sort_values('crim', ascending = False)

In [22]:
df['crim'][:10] = df['crim'].iloc[9]

/tmp/ipykernel_149915/3392630621.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['crim'][:10] = df['crim'].iloc[9]
/tmp/ipykernel_149915/3392630621.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['crim'][:10] = df['crim'].iloc[9]

In [23]:
df.head(5)

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
380,381,25.9406,0.0,18.1,0,0.671,6.968,91.9,1.4165,24,666,20.2,396.90,17.21,10.4
418,419,25.9406,0.0,18.1,0,0.679,5.957,100.0,1.8026,24,666,20.2,16.45,20.62,8.8
405,406,25.9406,0.0,18.1,0,0.693,5.683,100.0,1.4254,24,666,20.2,384.97,22.98,5.0
410,411,25.9406,0.0,18.1,0,0.597,5.757,100.0,1.4130,24,666,20.2,2.60,10.11,15.0
414,415,25.9406,0.0,18.1,0,0.693,4.519,100.0,1.6582,24,666,20.2,88.27,36.98,7.0

In [26]:
result_df = df[df['age'] >= 80]

In [27]:
answer = result_df['crim'].mean()

In [29]:
answer = round(answer,2)

In [30]:
answer

5.76

In [49]:
df = pd.read_csv('/home/skanrns97/dataset/P210202.csv')

In [50]:
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [51]:
result_df = df.iloc[:(int(len(df)*0.8))]

In [52]:
median = df['total_bedrooms'].median()
before_std = result_df['total_bedrooms'].std()

In [53]:
result_df['total_bedrooms'] = result_df['total_bedrooms'].fillna(median)

/tmp/ipykernel_149915/1491856302.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  result_df['total_bedrooms'] = result_df['total_bedrooms'].fillna(median)

In [54]:
after_std = result_df['total_bedrooms'].std()

In [55]:
answer = round(abs(before_std - after_std), 2)
print(answer)

1.97

In [67]:
df = pd.read_csv('/home/skanrns97/dataset/P210203.csv')

In [68]:
std = df['charges'].std()
mean = df['charges'].mean()

In [69]:
result_df = df[(df['charges'] <= (mean-(1.5*std))) | (df['charges'] >= (mean+(1.5*std)))]

In [70]:
answer = int(sum(result_df['charges']))
print(answer)

6421430

In [76]:
df = pd.read_csv('/home/skanrns97/dataset/P210301.csv')

In [77]:
df = df.dropna()

In [78]:
train_df = df[:int(len(df)*0.7)]

In [81]:
answer = int(np.quantile(train_df['housing_median_age'], q = 0.25))

In [82]:
answer

19

In [83]:
df = pd.read_csv('/home/skanrns97/dataset/P210302.csv')

In [84]:
nc = df.isna().sum() / len(df)

In [86]:
nc = nc.sort_values(ascending = False)

In [92]:
answer = nc.keys()[0]

In [93]:
answer

'Age'

In [94]:
df = pd.read_csv('/home/skanrns97/dataset/P220401.csv')

In [95]:
df.head(5)

   x   y
0  1  86
1  2  91
2  3  15
3  4  50
4  5  78

In [96]:
y1 = np.quantile(df['y'], q = 0.25)
y3 = np.quantile(df['y'], q = 0.75)
answer = int(y3-y1)
answer

36

In [97]:
df = pd.read_csv('/home/skanrns97/dataset/P220402.csv')

In [98]:
df.head(5)

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,1,video,4/22/2018 6:00,529,512,262,432,92,3,1,1,0
1,2,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0
2,3,video,4/21/2018 6:17,227,236,57,204,21,1,1,0,0
3,4,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0
4,5,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0

In [102]:
df['rate'] = (df['num_loves'] + df['num_wows']) / df['num_reactions']

In [104]:
answer = len(df[(df['rate'] > 0.4) & (df['rate'] < 0.5)])
print(answer)

90

In [107]:
df = pd.read_csv('/home/skanrns97/dataset/P220403.csv')
df['date_added']

0       September 25, 2021
1       September 24, 2021
2       September 24, 2021
3       September 24, 2021
4       September 24, 2021
               ...
8802     November 20, 2019
8803          July 1, 2019
8804      November 1, 2019
8805      January 11, 2020
8806         March 2, 2019
Name: date_added, Length: 8807, dtype: object

In [108]:
df['date_added'] = pd.to_datetime(df['date_added'], format = '%B %d, %Y')

In [110]:
result = df[(df['country'] == 'United Kingdom') & (df['date_added'].dt.year == 2018) & (df['date_added'].dt.month == 1)]
answer = len(result)
answer

6

In [114]:
df = pd.read_csv('/home/skanrns97/dataset/P220501.csv', encoding = 'euc-kr')

In [115]:
df.head(5)

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1L가격,1.5L가격,2L가격,2.5L가격,...,60L가격,75L가격,100L가격,120L가격,125L가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
1,경기도,안양시,규격봉투,매립용,생활쓰레기,기타,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
2,경기도,안양시,규격봉투,소각용,음식물쓰레기,가정용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
3,경기도,안양시,규격봉투,소각용,음식물쓰레기,사업장용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
4,경기도,안양시,규격봉투,소각용,음식물쓰레기,기타,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시

In [116]:
result = df[(df['종량제봉투종류'] == '규격봉투') & (df['종량제봉투용도'] == '음식물쓰레기') & (df['2L가격'] != 0)]

In [117]:
answer = result['2L가격'].mean()

In [121]:
answer = round(answer,0)

In [122]:
answer

121.0

In [124]:
df = pd.read_csv('/home/skanrns97/dataset/P220502.csv')

In [125]:
df.head(5)

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

In [126]:
df['bmi'] = df['Weight'] / (df['Height'] / 100)**2

In [130]:
normal = len(df[(df['bmi'] >= 18.5) & (df['bmi'] < 23)])
danger = len(df[(df['bmi'] >= 23) & (df['bmi'] < 25)])

In [131]:
answer = abs(normal-danger)
answer = round(answer,0)
answer

28

In [141]:
df = pd.read_csv('/home/skanrns97/dataset/P220503.csv', encoding = 'euc-kr')

In [142]:
df.head(5)

,시도교육청,지역교육청,지역,정보공시 학교코드,학교명,학교급코드,설립구분,제외여부,제외사유,1학년 전입학생수,...,4학년 전체학생수,5학년 전입학생수,5학년 전출학생수,5학년 전체학생수,6학년 전입학생수,6학년 전출학생수,6학년 전체 학생수,전입학생수(계),전출학생수(계),전체학생수(계)
0,서울특별시교육청,교육부,서울특별시 서초구,S000003511,서울교육대학교부설초등학교,2,국립,N,NaN,1,...,103,0,1,112,0,1,105,2,5,616
1,서울특별시교육청,교육부,서울특별시 종로구,S000003563,서울대학교사범대학부설초등학교,2,국립,N,NaN,1,...,105,3,5,109,1,0,110,21,18,632
2,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000738,서울개일초등학교,2,공립,N,NaN,18,...,123,46,4,136,41,6,170,232,36,837
3,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000741,서울구룡초등학교,2,공립,N,NaN,5,...,74,9,3,85,7,2,86,49,14,492
4,서울특별시교육청,서울특별시강남서초교육지원청,서울특별시 강남구,S010000742,서울논현초등학교,2,공립,N,NaN,1,...,54,4,4,65,4,1,52,14,26,339

In [151]:
df['순전입학생수'] = df['전입학생수(계)'] - df['전출학생수(계)']
df = df.sort_values('순전입학생수', ascending = False)

In [152]:
df.head(5)

,시도교육청,지역교육청,지역,정보공시 학교코드,학교명,학교급코드,설립구분,제외여부,제외사유,1학년 전입학생수,...,5학년 전입학생수,5학년 전출학생수,5학년 전체학생수,6학년 전입학생수,6학년 전출학생수,6학년 전체 학생수,전입학생수(계),전출학생수(계),전체학생수(계),순전입학생수
3563,강원도교육청,강원도원주교육지원청,강원도 원주시,S100003975,섬강초등학교,2,공립,N,NaN,83,...,204,3,123,152,2,110,1187,24,956,1163
1394,인천광역시교육청,인천광역시남부교육지원청,인천광역시 중구,S040002283,인천중산초등학교,2,공립,N,NaN,44,...,216,3,191,140,3,118,1119,18,1170,1101
3162,경기도교육청,경기도구리남양주교육지원청,경기도 남양주시,S090007275,다산한강초등학교,2,공립,N,NaN,240,...,139,0,35,85,1,38,1039,12,303,1027
3154,경기도교육청,경기도평택교육지원청,경기도 평택시,S090007240,용죽초등학교,2,공립,N,NaN,34,...,177,1,146,119,3,98,960,18,1090,942
6164,경상남도교육청,김해교육지원청,경상남도 김해시,S160003928,김해모산초등학교,2,공립,N,NaN,70,...,166,3,119,93,3,62,821,15,628,806

In [153]:
df['전체학생수(계)'].iloc[0]

956

In [161]:
df = pd.read_csv('/home/skanrns97/dataset/P230601.csv')

In [162]:
df.head(5)

               신고일시              출동일시    출동소방서
0  2018-01-02 11:45  2018-01-02 11:50    양평소방서
1  2018-01-04 01:56  2018-01-04 02:00  수원남부소방서
2  2018-01-05 16:54  2018-01-05 16:54    김포소방서
3  2018-01-07 00:56  2018-01-07 01:01    포천소방서
4  2018-01-05 16:54  2018-01-05 16:55    고양소방서

In [167]:
df['신고일시'] = pd.to_datetime(df['신고일시'])
df['출동일시'] = pd.to_datetime(df['출동일시'])

In [173]:
df['minus'] = (df['출동일시'] - df['신고일시']).dt.total_seconds()

In [177]:
df = df.groupby([df['출동소방서'], df['신고일시'].dt.year, df['신고일시'].dt.month]).mean('minus')

In [180]:
df = df.sort_values('minus', ascending = False)

In [182]:
result = df.iloc[0]

In [184]:
answer = float(result['minus'] / 60)
answer = round(answer)

In [185]:
answer

64

In [186]:
df = pd.read_csv('/home/skanrns97/dataset/P230602.csv')

In [188]:
df['total'] = df['student_1'] + df['student_2'] + df['student_3'] + df['student_4'] + df['student_5'] + df['student_6']
df['rate'] = df['total'] / df['teacher']

In [189]:
df = df.sort_values(by = 'rate', ascending = False)
df.head(5)

,school_name,student_1,student_2,student_3,student_4,student_5,student_6,teacher,total,rate
1044,대구삼육초등학교,36,39,40,39,37,28,6,219,36.500000
3387,원주삼육초등학교,84,90,90,90,96,96,16,546,34.125000
1464,광주삼육초등학교,90,96,96,96,102,102,18,582,32.333333
360,태강삼육초등학교,129,128,128,128,128,128,24,769,32.041667
687,동성초등학교,128,128,128,128,127,89,23,728,31.652174

In [190]:
answer = int(df['teacher'].iloc[0])
answer

6

In [243]:
df = pd.read_csv('/home/skanrns97/dataset/P230603.csv')

In [244]:
df.head(5)

        년월  강력범   절도범   폭력범   지능범  풍속범  기타형사범
0  2007-01  291  2608  6494  5283  242   1126
1  2007-02  252  2403  4613  4270  158    880
2  2007-03  292  2273  6242  5110  196   1119
3  2007-04  306  2794  6813  5492  250   1311
4  2007-05  298  3469  7221  5432  192   1412

In [245]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   년월      84 non-null     object
 1   강력범     84 non-null     int64
 2   절도범     84 non-null     int64
 3   폭력범     84 non-null     int64
 4   지능범     84 non-null     int64
 5   풍속범     84 non-null     int64
 6   기타형사범   84 non-null     int64
dtypes: int64(6), object(1)
memory usage: 4.7+ KB

In [246]:
df['year'] = df['년월'].str[:4]
df['total'] = df['강력범'] + df['절도범'] + df['폭력범'] + df['지능범'] + df['풍속범'] + df['기타형사범']

In [247]:
result = df.groupby('year', as_index=False).sum('total').sort_values('total', ascending = False)

In [253]:
answer_df = df[df['year'] == result['year'].iloc[0]]

In [254]:
answer_df

         년월  강력범   절도범   폭력범   지능범  풍속범  기타형사범  year  total
72  2013-01  396  4858  4990  6336  126   1631  2013  18337
73  2013-02  346  4382  4192  4900  115   1259  2013  15194
74  2013-03  444  4266  4936  5829  129   1495  2013  17099
75  2013-04  546  4915  5363  6499  125   1748  2013  19196
76  2013-05  558  5203  5834  7029  133   1662  2013  20419
77  2013-06  619  5871  5740  6133  142   1640  2013  20145
78  2013-07  649  5830  6366  7115  146   1930  2013  22036
79  2013-08  615  5650  5796  6345  120   1764  2013  20290
80  2013-09  547  5602  5603  6126  139   1693  2013  19710
81  2013-01  669  5690  6016  6762  166   2099  2013  21402
82  2013-11  415  4702  5367  6962  115   1988  2013  19549
83  2013-12  472  4616  5219  6505  106   1656  2013  18574

In [255]:
answer = int(answer_df['total'].mean())
answer

19329